app/controllers/triggers_controller.rb

SELECT COUNT(*) FROM "rates"
SELECT  "rates".* FROM "rates" ORDER BY "rates"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def create
    @triggers = Trigger.cached_all
    @trigger = Trigger.new(trigger_params)
    if Rate.all.count == 0
      AddRateJob.perform_now
    end
    @rates = Rate.cached_all
    todayRates = @rates.select { |rate| rate.time.to_date == DateTime.now.to_date }

INSERT INTO "triggers" ("email", "currency", "operation", "kind", "rate", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
      todayRates.collect{|rate| rate.eurSell}.each{|eurSell| @averageEurSell+=eurSell}
      @averageEurSell = @averageEurSell/count
    end
    if @trigger.save

DELETE FROM "triggers" WHERE "triggers"."id" = $1  [["id", 1]]
---
  def destroy
    @trigger = Trigger.destroy(params[:id])