app/controllers/triggers_controller.rb

  def destroy
    @trigger = Trigger.destroy(params[:id])
    @triggers = Trigger.cached_all.select { |trigger| trigger.email == Trigger.get_email }
---
SELECT "triggers".* FROM "triggers"