app/controllers/welcome_controller.rb

  def index
    if Rate.cached_all.count == 0
      AddRateJob.perform_now
    end
    @triggers = Trigger.cached_all
    @rates = Rate.cached_all
    todayRates = @rates.select { |rate| rate.time.to_date == DateTime.now.to_date }
---
SELECT  "rates".* FROM "rates" ORDER BY "rates"."id" DESC LIMIT $1  [["LIMIT", 1]]

  def show
    if Rate.cached_all.count == 0
      AddRateJob.perform_now
    end
    @rates = Rate.cached_all
    @triggers = Trigger.cached_all
    todayRates = @rates.select { |rate| rate.time.to_date == DateTime.now.to_date }
---
SELECT  "rates".* FROM "rates" ORDER BY "rates"."id" DESC LIMIT $1  [["LIMIT", 1]]