app/views/triggers/index.html.erb

SELECT "triggers".* FROM "triggers"
---
  <div class="container col-sm-12">
    <h1 id="triggers_header"><%= pluralize(@triggers.size, t(:trigger)) %></h1>